Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Using the RESTEasy REST Client is as simple as creating an interface using the proper Jakarta REST and MicroProfile annotations. In our case the interface should be created at `src/main/java/org/acme/rest/client/ExtensionsService.java` and have the following content:
ja_jp: RESTEasy REST Client の使用方法は、適切な Jakarta REST と MicroProfile アノテーションを使用してインターフェースを作成するだけです。この場合、インターフェースは `src/main/java/org/acme/rest/client/ExtensionsService.java` で作成し、以下の内容を持つ必要があります:

source: Using the RESTEasy REST Client is as simple as creating an interface using the proper Jakarta REST and MicroProfile annotations. In our case the interface should be created at `src/main/java/org/acme/rest/client/multipart/MultipartService.java` and have the following content:
ja_jp: RESTEasy REST Client の使用方法は、適切な Jakarta REST と MicroProfile アノテーションを使用してインターフェースを作成するだけです。この場合、インターフェースは `src/main/java/org/acme/rest/client/multipart/MultipartService.java` で作成し、以下の内容を持つ必要があります:

source: Using the Reactive REST Client
ja_jp: リアクティブRESTクライアントの使用

source: Using the Redis Client
ja_jp: Redisクライアントの使用

source: Using the Spring MVC compatibility layer
ja_jp: Spring MVC 互換レイヤーの使用

source: Using the TLS centralized configuration
ja_jp: TLS 集中設定の使用

source: Using the TLS registry
ja_jp: TLS レジストリーの使用

source: Using the Typesafe client
ja_jp: Typesafeクライアントの使用

source: Using the Vert.x Web Router
ja_jp: Vert.x Web ルーターの使用

source: Using the Web Bundler to bundle and minify scripts, styles, and packages
ja_jp: Web Bundler を使用してスクリプト、スタイル、パッケージをバンドルおよびミニファイする

source: Using the _Quarkus: Generate a Quarkus project_ command, there is the option to add the `RESTEasy Qute` extension for the downloaded Quarkus project to be initialized with a Qute template.
ja_jp: _Quarkus: Generate a Quarkus project_ コマンドを使用すると、ダウンロードしたQuarkusプロジェクトをQuteテンプレートで初期化するために、 `RESTEasy Qute` エクステンションを追加するオプションがあります。

source: Using the `Emitter` you are sending messages from your imperative code to reactive messaging. These messages are stored in a queue until they are sent. If the Kafka producer client can't keep up with messages trying to be sent over to Kafka, this queue can become a memory hog and you may even run out of memory. You can use `@OnOverflow` to configure back-pressure strategy. It lets you configure the size of the queue (default is 256) and the strategy to apply when the buffer size is reached. Available strategies are `DROP`, `LATEST`, `FAIL`, `BUFFER`, `UNBOUNDED_BUFFER` and `NONE`.
ja_jp: `Emitter` を使用すると、命令型コードから Reactive Messaging にメッセージを送信します。これらのメッセージは送信されるまでキューに保存されます。Kafka プロデューサークライアントが Kafka に送信しようとするメッセージに対応できない場合、このキューはメモリを大量に消費し、メモリ不足になる可能性があります。 `@OnOverflow` を使用して、バックプレッシャーストラテジーを設定することができます。これにより、キューのサイズ（デフォルトは 256）およびバッファーサイズに達したときに適用するストラテジーを設定できます。利用可能なストラテジーは、 `DROP`、 `LATEST`、 `FAIL`、 `BUFFER`、 `UNBOUNDED_BUFFER` および `NONE` です。

source: Using the `HelloPropagation` class from before we can add the following 2 methods, `createBaggage()` and `receiveAndUseBaggage()`.
ja_jp: 前述の `HelloPropagation` クラスを使用して、次の 2 つのメソッド `createBaggage()` と `receiveAndUseBaggage()` を追加できます。

source: Using the `JsonWebToken` and claim injection
ja_jp: `JsonWebToken` とクレームインジェクションの使用

source: Using the `client-id` property
ja_jp: `client-id`プロパティーの使用

source: Using the `health-topic-verification-enabled=true` attribute, _startup_ probe uses an _admin client_ to check for the list of topics. Whereas the _readiness_ probe for an incoming channel checks that at least one partition is assigned for consumption, and for an outgoing channel checks that the topic used by the producer exist in the broker.
ja_jp: `health-topic-verification-enabled=true` 属性を使用すると、_startup_ プローブは _admin client_ を使用してトピックのリストをチェックします。_readiness_ プローブの場合、着信チャンネル用は、少なくとも 1 つのパーティションが消費のために割り当てられていることをチェックし、送信チャンネル用は、プロデューサーが使用するトピックがブローカーに存在していることをチェックします。

source: Using the `packages` configuration property is simple:
ja_jp: `packages` 設定プロパティーは簡単です:

source: Using the `quarkus-rest-qute` extension:
ja_jp: `quarkus-rest-qute` エクステンション の使用:

source: Using the `quarkus.native.resources.includes` configuration property
ja_jp: `quarkus.native.resources.includes` 設定プロパティの使用

source: Using the `refresh_token` grant which uses an out of band refresh token to acquire a new set of tokens will be required if the existing refresh token has been posted to the current Quarkus endpoint for it to acquire the access token. In this case `OidcClient` needs to be configured as follows:
ja_jp: アクセストークンを取得するために、既存のリフレッシュトークンが現在の Quarkus エンドポイントにポストされた場合、新しいトークンセットを取得するために帯域外のリフレッシュトークンを使用する `refresh_token` グラントを使用する必要があります。この場合、 `OidcClient` を次のように設定する必要があります。

source: Using the `refresh_token` grant which uses an out-of-band refresh token to acquire a new set of tokens will be required if the existing refresh token has been posted to the current Quarkus endpoint for it to acquire the access token. In this case `OidcClient` needs to be configured as follows:
ja_jp: アクセストークンを取得するために、既存のリフレッシュトークンが現在の Quarkus エンドポイントにポストされた場合、帯域外リフレッシュトークンを使用して新しいトークンセットを取得する `refresh_token` グラントを使用する必要があります。この場合、 `OidcClient` を次のように設定する必要があります。

source: Using the `token exchange` grant may be required if you are building a complex microservices application and would like to avoid the same `Bearer` token be propagated to and used by more than one service. Please see <<token-propagation,Token Propagation in MicroProfile RestClient client filter>> for more details.
ja_jp: 複雑なマイクロサービスアプリケーションを構築していて、同じ `Bearer` トークンが複数のサービスに伝搬して使用されるのを避けたい場合、 `token exchange` グラントを使用する必要がある場合があります。詳しくは <<token-propagation,MicroProfile RestClient client filterにおけるトークン伝搬>> を参照してください。

source: Using the `urn:ietf:params:oauth:grant-type:token-exchange` or `urn:ietf:params:oauth:grant-type:jwt-bearer` grants might be required if you are building a complex microservices application and want to avoid the same `Bearer` token be propagated to and used by more than one service. See <<token-propagation-reactive,Token Propagation in MicroProfile RestClient Reactive filter>> and <<token-propagation,Token Propagation in MicroProfile RestClient filter>> for more details.
ja_jp: 複雑なマイクロサービスアプリケーションを構築していて、同じ `Bearer` トークンが複数のサービスに伝播されて使用されるのを避ける場合は、 `urn:ietf:params:oauth:grant-type:token-exchange` または `urn:ietf:params:oauth:grant-type:jwt-bearer` グラントの使用が必要になる場合があります。詳細は、<<token-propagation-reactive,MicroProfile RestClient Reactive filterにおけるトークン伝搬>> と<<token-propagation,in MicroProfile RestClient filterにおけるトークン伝播>> を参照してください。

source: Using the `urn:ietf:params:oauth:grant-type:token-exchange` or `urn:ietf:params:oauth:grant-type:jwt-bearer` grants might be required if you are building a complex microservices application and want to avoid the same `Bearer` token be propagated to and used by more than one service. See <<token-propagation-rest,Token Propagation for Quarkus REST>> and <<token-propagation-resteasy,Token Propagation for RESTEasy Classic>> for more details.
ja_jp: 複雑なマイクロサービスアプリケーションを構築していて、同じ `Bearer` トークンが複数のサービスに伝播されて使用されるのを避ける場合は、 `urn:ietf:params:oauth:grant-type:token-exchange` または `urn:ietf:params:oauth:grant-type:jwt-bearer` グラントの使用が必要になる場合があります。詳細は、<<token-propagation-rest,Token Propagation for Quarkus REST>> と<<token-propagation-resteasy,Token Propagation for RESTEasy Classic>> を参照してください。

source: Using the `urn:ietf:params:oauth:grant-type:token-exchange` or `urn:ietf:params:oauth:grant-type:jwt-bearer` grants might be required if you are building a complex microservices application and want to avoid the same `Bearer` token being propagated to and used by more than one service.
ja_jp: 複雑なマイクロサービスアプリケーションを構築しており、同じ `Bearer` トークンが複数のサービスに伝播されて使用されるのを避けたい場合は、 `urn:ietf:params:oauth:grant-type:token-exchange` または `urn:ietf:params:oauth:grant-type:jwt-bearer` グラントの使用が必要になる場合があります。

source: Using the `{web-locator-ga}` extension
ja_jp: `{web-locator-ga}` エクステンションの使用

source: Using the active record pattern
ja_jp: アクティブレコードパターンの使用

source: Using the active-record pattern
ja_jp: アクティブ・レコード・パターンの使用

source: Using the agent and applying the generated data can be difficult for Quarkus users. First, the agent can be cumbersome because it requires the JVM arguments to be modified, and the generated configuration needs to be placed in a specific location such that the subsequent native image builds picks them up. Secondly, the native image configuration produced contains a lot of superfluous configuration that the Quarkus integration takes care of.
ja_jp: Quarkus ユーザーにとって、エージェントの使用や生成データの適用は難しい場合があります。 まず、エージェントは JVM 引数の変更が必要であり、生成された設定を特定の場所に配置して、後続のネイティブイメージのビルドで認識されるようにする必要があります。 次に、生成されるネイティブイメージの設定には不要な設定が多く含まれており、Quarkus の統合機能がすでに処理しているものも含まれています。

source: Using the archive
ja_jp: アーカイブの利用

source: Using the archive is done by using the `-XX:SharedArchiveFile` flag. However, a few caveats apply:
ja_jp: アーカイブの使用は、 `-XX:SharedArchiveFile` フラグを使用することで可能です。ただし、いくつかの注意事項があります。

source: Using the authorization code flow mechanism
ja_jp: 認可コードフローメカニズムの利用について

source: Using the base image
ja_jp: ベースイメージの利用

source: Using the centralized TLS configuration
ja_jp: 一元化された TLS 設定の使用

source: Using the container-image extensions
ja_jp: コンテナーイメージのエクステンションの使用

source: Using the event bus
ja_jp: イベントバスの使用

source: Using the extension
ja_jp: エクステンションの使用

source: Using the high-level clients (data sources)
ja_jp: 高レベルのクライアント (データソース) の利用

source: Using the legacy REST Client
ja_jp: レガシーREST クライアントの利用

source: Using the legacy REST Client with Multipart
ja_jp: マルチパートでのRESTクライアントの使用

source: Using the managed HTTP server
ja_jp: 管理されたHTTPサーバーの使用

source: Using the managed Vert.x instance
ja_jp: 管理された Vert.x インスタンスの使用

source: Using the parsed `XmlConfig` instance, create an instance of `RuntimeXmlConfigService` and wrap it in a `RuntimeValue`. Use a `RuntimeValue` wrapper for non-interface objects that are non-proxiable.
ja_jp: 解析された `XmlConfig` インスタンスを使用して、 `RuntimeXmlConfigService` のインスタンスを作成し、それを `RuntimeValue` でラップします。プロキシー不可能な非インターフェイスオブジェクトには `RuntimeValue` ラッパーを使用します。

source: Using the reactive mailer
ja_jp: リアクティブmailerの使用

source: Using the repository
ja_jp: リポジトリの使用

source: Using the repository can be done by simply injecting it where you intend to use it:
ja_jp: リポジトリを使用するには、使用したい場所にインジェクトするだけです。

source: Using the repository pattern
ja_jp: リポジトリパターンの使用

source: Using the runtime certificate configuration, supported by GraalVM since 21.3 does not require any special or additional configuration compared to regular java programs or Quarkus in jvm mode. For more information, see the link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/dynamic-features/CertificateManagement/#runtime-options[Runtime Options] section of the "GraalVM Certificate Management in Native Image" guide.
ja_jp: 21.3以降GraalVMでサポートされている実行時証明書設定を使用すると、通常のJavaプログラムやjvmモードのQuarkusと比べて、特別な追加設定は必要ありません。 詳細については、「ネイティブイメージでのGraalVM証明書管理」ガイドの link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/dynamic-features/CertificateManagement/#runtime-options[実行時オプション] セクションを参照してください。

source: Using the runtime certificate configuration, supported by GraalVM since 21.3 does not require any special or additional configuration compared to regular java programs or Quarkus in jvm mode. See the https://www.graalvm.org/reference-manual/native-image/CertificateManagement/#run-time-options[GraalVM documentation] for more information.
ja_jp: 21.3以降のGraalVMでサポートされている実行時証明書の設定を使用しても、通常のJavaプログラムやjvmモードのQuarkusと比較して、特別な設定や追加の設定は必要ありません。詳しくは、 link:https://www.graalvm.org/reference-manual/native-image/CertificateManagement/#run-time-options[GraalVMのドキュメント]をご覧ください。

source: Using the runtime certificate configuration, supported by GraalVM since 21.3 does not require any special or additional configuration compared to regular java programs or Quarkus in jvm mode. See the https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/CertificateManagement/#run-time-options[GraalVM documentation] for more information.
ja_jp: 21.3以降のGraalVMでサポートされている実行時証明書の設定を使用しても、通常のJavaプログラムやjvmモードのQuarkusと比較して、特別な設定や追加の設定は必要ありません。詳しくは、 https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/CertificateManagement/#run-time-options[GraalVMのドキュメント] をご覧ください。

source: Using the runtime certificate configuration, supported by GraalVM since 21.3 does not require any special or additional configuration compared to regular java programs or Quarkus in jvm mode. See the https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/dynamic-features/CertificateManagement/#runtime-options[GraalVM documentation] for more information.
ja_jp: 21.3以降のGraalVMでサポートされている実行時証明書設定を使用することは、通常のJavaプログラムやjvmモードのQuarkusと比較して、特別な設定や追加の設定は必要ありません。詳しくは、 https://www.graalvm.org/22.2/reference-manual/native-image/CertificateManagement/#run-time-options[GraalVMのドキュメント] をご覧ください。

source: Using the synchronous methods of the link:{mutiny-vertx-sql}[smallrye-mutiny-vertx-sqlclient] along with virtual threads will allow you to use the synchronous blocking style, avoid pinning the carrier thread, and get performance close to a pure reactive implementation.
ja_jp: link:{mutiny-vertx-sql}[smallrye-mutiny-vertx-sqlclient] の同期メソッドと仮想スレッドを使用することで、同期ブロッキングスタイルを使用でき、キャリアスレッドの拘束を回避し、純粋なリアクティブ実装に近い性能を得ることができます。

source: Using the tooling to generate your local extension codestart during dev is not yet available Quarkiverse/Standalone extension (Until then, you may use the tests and follow https://github.com/quarkusio/quarkus/issues/21165[#21165, window="_blank"] for updates).
ja_jp: 開発中にローカルのエクステンションのcodestartを生成するためのツールを使用することは、 Quarkiverse/Standalone エクステンション (それまでは、テストを使用したり、 link:https://github.com/quarkusio/quarkus/issues/21165[#21165, window=_blank]のアップデートに従うことができます) ではまだ利用できません。

source: Using the underlying Vert.x Mail Client
ja_jp: Vert.xのメールクライアントの使用

source: Using the xref:telemetry-micrometer#counters[@Counted] interceptor.
ja_jp: xref:telemetry-micrometer#counters[@Counted] インターセプターを使用する場合。

source: Using the xref:telemetry-micrometer#create-a-timer[@Timed] interceptor.
ja_jp: xref:telemetry-micrometer#create-a-timer[@Timed] インターセプターを使用する場合。

source: Using this approach requires to have `protoc` installed locally. It will not download any `protoc` artifact.
ja_jp: この方法を使用するには、 `protoc` をローカルにインストールする必要があります。 `protoc` アーティファクトはダウンロードされません。

source: Using this command, you'll forward the traffic from the "localhost:5005" to the kubernetes service running the java agent using the port "5005" which is the one that the java agent uses by default for remote debugging. You can also configure another java agent port using the property `quarkus.kubernetes.remote-debug.address-port`.
ja_jp: このコマンドを使用すると、java エージェントがリモートデバッグ用にデフォルトで使用するポート "5005" を使用して、"localhost:5005" からのトラフィックを java エージェントを実行している kubernetes サービスに転送することになります。プロパティー `quarkus.kubernetes.remote-debug.address-port` を使用して、別の java エージェントポートを設定することも可能です。

source: Using this injected bean of type `RestLinksProvider`, you can get the links by type using the method `RestLinksProvider.getTypeLinks` or get the links by a concrete instance using the method `RestLinksProvider.getInstanceLinks`.
ja_jp: 型 `RestLinksProvider` の挿入された Bean を使用すると、メソッド `RestLinksProvider.getTypeLinks` を使用して型ごとにリンクを取得するか、メソッド `RestLinksProvider.getInstanceLinks` を使用して具象インスタンスによってリンクを取得できます。

source: Using this pattern, you can enable specific alternatives for any given test.
ja_jp: このパターンを使用すると、任意のテストに対して特定の選択肢を有効にすることができます。

source: Using transactions
ja_jp: トランザクションの使用

source: Using transactions in Quarkus
ja_jp: Quarkusでのトランザクションの使用

source: Using unique consumer groups
ja_jp: 一意のコンシューマーグループの活用

source: Using verticles
ja_jp: verticleの使用

source: Using xDS gRPC
ja_jp: xDS gRPCの使用

source: Using xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] is recommended for integration testing against Keycloak. `Dev Services for Keycloak` will start and initialize a test container: it will create a `quarkus` realm, a `quarkus-app` client (`secret` secret), and add `alice` (`admin` and `user` roles) and `bob` (`user` role) users, where all of these properties can be customized.
ja_jp: Keycloak に対する結合テストには、xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] を使用することを推奨します。 `Dev Services for Keycloak` は、テストコンテナーを起動して初期化します。これにより、 `quarkus` レルム、 `quarkus-app` クライアント (`secret` シークレット) が作成され、 `alice` (`admin` および `user` ロール) および `bob` (`user` ロール) ユーザーが追加されます。これらのプロパティーは、すべてカスタマイズできます。

source: Using xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] is recommended for the integration testing against Keycloak. `Dev Services for Keycloak` will launch and initialize a test container: it will create a `quarkus` realm, a `quarkus-app` client (`secret` secret) and add `alice` (`admin` and `user` roles) and `bob` (`user` role) users, where all of these properties can be customized.
ja_jp: Keycloak に対する統合テストには、xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] を使用することをお勧めします。 `Dev Services for Keycloak` は、テストコンテナーを起動して初期化します。これにより、 `quarkus` レルム、 `quarkus-app` クライアント (`secret` シークレット) が作成され、 `alice` (`admin` および `user` ロール) および `bob` (`user` ロール) ユーザーが追加されます。これらのプロパティーはすべてカスタマイズできます。

source: Using xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] is recommended for the integration testing against Keycloak. `Dev Services for Keycloak` will launch and initialize a test container: it will import configured realms and set a base Keycloak URL for `CustomTenantResolver` used in this quickstart to calculate a realm specific URL.
ja_jp: Keycloakに対する統合テストには、 link:security-openid-connect-dev-services.html[Dev Services for Keycloak] の使用を推奨します。 `Dev Services for Keycloak` はテストコンテナを起動し初期化します。設定されたレルムをインポートし、このクイックスタートで使用される `CustomTenantResolver` のベース Keycloak URL を設定して、レルム固有の URL を計算します。

source: Using your load balancer
ja_jp: ロードバランサーの使用

source: Using your service discovery
ja_jp: サービスディスカバリーの利用

source: Usually, Java frameworks do their bootstrapping during the runtime before actually starting the application "Business oriented layer". During bootstrap, frameworks dynamically collect metadata by scanning the classpath to find configurations, entity definitions, dependency injection binding, etc. in order to instantiate proper objects through reflection. The main consequences are:
ja_jp: 通常、Javaフレームワークは、アプリケーションの "ビジネス志向のレイヤー" を実際に起動する前に、実行時中にブートストラップを行います。ブートストラップの際、フレームワークは、リフレクションによって適切なオブジェクトをインスタンス化するために、設定、エンティティー定義、依存関係の注入バインディングなどを見つけるためにクラスパスをスキャンします。これにより、動的にメタデータを収集します。主な結果は以下の通りです。

source: Usually, a Quarkus extension registry will be implemented as a Maven snapshot repository. The platform and extension catalogs resolved from the registry as Maven artifacts will be cached in the user's local Maven repository. The platform and extension catalogs are actually `SNAPSHOT` artifacts that are periodically checked for updates by the registry client. The default registry interval to check for updates matches the default value of the Maven's `updatePolicy` for https://maven.apache.org/settings.html#repositories[snapshot repositories] and is `daily`. This default can be overridden in the registry configuration, for example:
ja_jp: 通常、Quarkusのエクステンションレジストリは、Mavenスナップショットリポジトリとして実装されます。レジストリからMavenアーティファクトとして解決されたプラットフォームおよびエクステンションカタログは、ユーザーのローカルMavenリポジトリにキャッシュされます。プラットフォームとエクステンションカタログは、実際には、レジストリクライアントによって定期的に更新がチェックされる `SNAPSHOT` アーティファクトです。更新をチェックするレジストリのデフォルトの間隔は、Maven の `updatePolicy` link:https://maven.apache.org/settings.html#repositories[snapshot repositories] のデフォルト値と一致しており、 `daily` となっています。このデフォルトは、例えばレジストリ設定で上書きすることができます:

source: Usually, a Quarkus extension registry will be implemented as a Maven snapshot repository. The platform and extension catalogs resolved from the registry as Maven artifacts will be cached in the user's local Maven repository. The platform and extension catalogs are actually `SNAPSHOT` artifacts that are periodically checked for updates by the registry client. The default registry interval to check for updates matches the default value of the Maven's `updatePolicy` for https://maven.apache.org/settings.html#repositories[snapshot repositories] and is `daily`. This default can be override in the registry configuration, for example:
ja_jp: 通常、Quarkusのエクステンションレジストリは、Mavenスナップショットリポジトリとして実装されます。レジストリからMavenアーティファクトとして解決されたプラットフォームおよびエクステンションカタログは、ユーザーのローカルMavenリポジトリにキャッシュされます。プラットフォームとエクステンションカタログは、実際には、レジストリクライアントによって定期的に更新がチェックされる `SNAPSHOT` アーティファクトです。更新をチェックするレジストリのデフォルトの間隔は、Maven の `updatePolicy` for link:https://maven.apache.org/settings.html#repositories[snapshot repositories]のデフォルト値と一致しており、 `daily` となっています。このデフォルトは、例えばレジストリ設定で上書きすることができます。

source: Usually, dependencies of an application (which is a Maven project) could be displayed using `mvn dependency:tree` command. In case of a Quarkus application, however, this command will list only the runtime dependencies of the application. Given that the Quarkus build process adds deployment dependencies of the extensions used in the application to the original application classpath, it could be useful to know which dependencies and which versions end up on the build classpath. Luckily, the `quarkus` Maven plugin includes the `dependency-tree` goal which displays the build dependency tree for the application.
ja_jp: 通常、アプリケーション(Mavenプロジェクト)の依存関係は、 `mvn dependency:tree` コマンドを使用して表示することができます。しかし、Quarkusアプリケーションの場合、このコマンドはアプリケーションの実行時の依存関係のみを表示します。Quarkusのビルドプロセスは、アプリケーションで使用されているエクステンションのデプロイメント依存関係を元のアプリケーションのクラスパスに追加するので、どの依存関係とどのバージョンがビルドクラスパスで終わるかを知ることは便利です。幸いにも、 `quarkus-bootstrap` Mavenプラグインには、アプリケーションのビルド依存関係ツリーを表示する `build-tree` ゴールが含まれています。

source: Usually, it's best to use a combination of `@QuarkusMainTest` tests for testing application externals, and `@QuarkusTest` tests for fine-grained testing which requires access to application internals.
ja_jp: 通常、アプリケーションの外部をテストするには `@QuarkusMainTest` テストの組み合わせを使用し、アプリケーションの内部へのアクセスを必要とするきめ細かいテストには `@QuarkusTest` テストを使用するのが最適です。

source: Usually, we look up classes in the index with an interface, a superclass or an annotation. It is less brittle and faster than crawling the whole index and filter by name.
ja_jp: 通常、インターフェイス、スーパークラス、アノテーションでインデックス内のクラスを検索します。これは、インデックス全体をクロールして名前でフィルタリングするよりも、脆くなく、速い方法です。

source: Utilizing Arc in an optimal manner for all necessary injections. RESTEasy Classic provides an abstraction layer that performs the various injection operations, which for the needs of Quarkus is entirely unnecessary since Arc provides the same functionality with better performance.
ja_jp: 必要なすべてのインジェクションに最適な方法でArcを活用します。RESTEasy Classic は、さまざまなインジェクション操作を実行する抽象化レイヤーを提供しますが、Arcは同じ機能をより優れたパフォーマンスで提供するため、Quarkus のニーズには全く不要です。

source: VSCode "run with" configuration
ja_jp: VSCode "run with" 設定

source: VSCode was able to become our defacto editor
ja_jp: VSCodeは、私たちにとってデファクトのエディタになることができました

source: Vaadin Web Components
ja_jp: Vaadin Web コンポーネント

source: Vale IDE plugins
ja_jp: Vale IDE プラグイン
